#Спортсмен-лыжник начал тренировки, пробежав в первый день 10 км. Каждый следующий день он увеличивал длину пробега на P процентов от пробега предыдущего дня (P — вещественное, 0< P <50). По данному P определить, после какого дня суммарный пробег лыжника за все дни превысит 200 км, и вывести найденное количество дней K (целое) и суммарный пробег S (вещественное число).
while True:
    try:
        P = float(input("Введите процент(от 0 до 50): "))
        if 0<P<50:
            break
        else:
            print("Ошибка: число должно быть строго больше 0 и меньше 50. Попробуйте снова.")   
    except ValueError:
        print("Ошибка: введено не число. Пожалуйста, введите вещественное число.")
F = 10.0
S = 10.0
K = 1
while S <= 200:
    K += 1
    F += F * (P/100)
    S += F
print(f"Количество дней: {K}")
print(f"Суммарный пробег: {round(S, 2)} км") #{S:.2f} можно так
