#Даны два целых числа A и B (A < Б). Найти произведение всех целых чисел от A до B включительно. 
while True:
    try:
        a = int(input("Введите 1е число: "))
        b = int(input("Введите 2е число: "))
        if a >= b:
            print("Ошибка: число a должно быть строго меньше b. Попробуйте еще раз.")
            continue
        p = 1
        for i in range(a, b+1):
            p *= i
        print(f"Произведение чисел: {p}")
    except ValueError:
        print("Ошибка ввода! Пожалуйста, вводите только целые числа.")