#вариант 7. Задача 1.
# Даны три целых числа: A, B, C. Проверить истинность высказывания: «Число B находится между числами A и C». 
a = input("Введите целое число A: ")
while type(a) != int:  # обработка исключений
    try:
        a = int(a)
    except ValueError:
        print("Неправильно ввели! Ожидается целое число.")
        a = input("Введите целое число A: ")

b = input("Введите целое число B: ")
while type(b) != int:  # обработка исключений
    try:
        b = int(b)
    except ValueError:
        print("Неправильно ввели! Ожидается целое число.")
        b = input("Введите целое число B: ")

c = input("Введите целое число C: ")
while type(c) != int:  # обработка исключений
    try:
        c = int(c)
    except ValueError:
        print("Неправильно ввели! Ожидается целое число.")
        c = input("Введите целое число C: ")
# условия для истины
if (a < b < c) or (c < b < a):
    print("Истина: число B находится между числами A и C.")
else:
    print("Ложь: число B НЕ находится между числами A и C.")
